Tekla.Structures.Model.Reinforcement.GetRebarComplexGeometries(System.Boolean,System.Boolean,System.Boolean,Tekla.Structures.Model.Reinforcement.RebarGeometrySimplificationTypeEnum)
Retrieves a list of physical reinforcing bars (of type ReinforcingBar).
These objects contain physical curves in the 3D space of each reinforcing bar as shown in model view.
In case rebar polygon clashes with itself, physical points are moved to avoid clashing. ReinforcingBar
only differs from RebarGeometry by containing a Polycurve rather than a Polyline.
withHooks: A parameter to determine whether the hook points should be included in the rebar geometry or not.
withoutClashes: A parameter to determine whether self-clash avoidance should be included in the rebar geometry or not.
lengthAdjustments: A parameter to determine whether rounding and step tapering should be included in the rebar geometry or not.
simplified: A parameter to determine whether the "simplified" rebar shape recognition geometry should be returned.
Returns: A list of Tekla.Structures.Model.RebarComplexGeometrys.